{
  "backend/main.mo": "Motoko backend actor managing notes, user profiles, and access control with authorization checks and storage mixins.",
  "feature_evidence.json": "Report listing feature evidence, associated frontend files, components, and test IDs for two access-control-related features.",
  "frontend-file-summaries.txt": "Reference file providing short descriptions of all major frontend files and their roles.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app wrapper configuring themes, React Query, and admin token initialization before rendering NotesPage.",
  "frontend/src/components/EditorContent.tsx": "Renders editable note blocks (text, heading, bullet, checklist, image) with formatting, drag UI, and block manipulation.",
  "frontend/src/components/EditorToolbar.tsx": "Toolbar allowing insertion of text, heading, bullet, checklist, and image blocks with client-side image upload.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution and a decorative icon.",
  "frontend/src/components/Header.tsx": "Header showing app branding, login button, and theme toggle.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading and error handling.",
  "frontend/src/components/NoteEditor.tsx": "Editor component for creating and updating notes, managing title, metadata, and rich-text blocks, and syncing with backend via queries.",
  "frontend/src/components/NotesList.tsx": "Displays a list of notes with preview, metadata, deletion, and loading states using styling helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdminTokenInitialization.ts": "Initializes backend access using an admin token for anonymous sessions and refreshes note queries after setup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and related state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on notes and checklist items using the backend actor.",
  "frontend/src/index.css": "Tailwind base configuration with custom CSS variables for light/dark themes and UI styling.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/NotesPage.tsx": "Renders the notes page with list and editor views, handling note creation permissions and selection state. Uses authentication and URL admin token to determine whether new notes can be created.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash/query parsing. Supports retrieving, storing, and clearing parameters for routing and token handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugins. Defines theme settings, container behavior, and custom color tokens using CSS variables.",
  "project_state.json": "Stores project metadata, feature definitions, known issues, and new feature requests. Tracks ongoing requirements for notes functionality, admin token behavior, and task-related fields."
}